0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2.0E-1 0 0);

boundaryField
{
    upstream
    {
        type            fixedValue;
        value           uniform (2.0E-1 0 0);
    }
    downstream
    {
        type            inletOutlet;
        inletValue      uniform (2.0E-1 0 0);
        value           $internalField;
    }
    upANDdown
    {
        type            inletOutlet;
        inletValue      uniform (2.0E-1 0 0);
        value           $internalField;
    }
    frontANDback
    {
        type            empty;
    }
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
