system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    timeStep;
    writeInterval   100;

    patches         ("cylinder");
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1000;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         0.02;
    lRef            0.01;        // Wheelbase length
    Aref            1.0E-5;        // Estimated
}


// ************************************************************************* //
